cf_billing/InformationRegisters/энргКоэффициентИзмененияЛимитовДифференцированныхТарифов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКоэффициентИзмененияЛимитовДифференцированныхТарифов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргКоэффициентИзмененияЛимитовДифференцированныхТарифов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ПолучениеДанных

// Заполняет актуальные данные.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Функция АктуальныеДанные(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема = Новый СхемаЗапроса;
		Пакет = Схема.ПакетЗапросов[0];
	Иначе
		Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаАктуальныеДанные());
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;
	ОператорВыбора 				= Пакет.Операторы[0];	
	Источник 					= ОператорВыбора.Источники[0].Источник;
	Параметры 					= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		ПараметрПериод = Параметры[0];
		ПараметрПериод.Выражение = Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		
		ДоступныеПараметры = "Организация, Район, Абонент";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(
			Параметры[1],
			ПараметрыОтбора.ПараметрыВТ,
			ДоступныеПараметры);	
			
		ДоступныеПараметры = "Коэффициент";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(
			ОператорВыбора.Отбор,
			"ТаблицаСрезПоследних",
			ПараметрыОтбора.ПараметрыВТ,
			ДоступныеПараметры);		
					
	КонецЕсли;	 	
		
	ВспомогательныеПоля = "Период,Регистратор,НомерСтроки,Активность";	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		
		мВспомогательныеПоля = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			
			Выражение = Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получает текст запроса актуальные данные.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаАктуальныеДанные() Экспорт
	
	Текст = 
	"ВЫБРАТЬ
	|	ТаблицаСрезПоследних.Организация КАК Организация,
	|	ТаблицаСрезПоследних.Район КАК Район,
	|	ТаблицаСрезПоследних.Абонент КАК Абонент,
	|	ТаблицаСрезПоследних.Коэффициент КАК Коэффициент
	|ИЗ
	|	РегистрСведений.энргКоэффициентИзмененияЛимитовДифференцированныхТарифов.СрезПоследних КАК ТаблицаСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
